Repository: i2phosts/py-i2phosts
Catalog: pyi2phosts/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Too long hostname (should be 67 chars max)
ru: Слишком длинное имя хоста (должно быть 67 символов максимум)

source: Hostname doesn't ends with .i2p
ru: Имя хоста не оканчивается на .i2p

source: Base32 hostnames are not allowed
ru: Base32-адреса не допускаются

source: Incomplete hostname
ru: Неполное имя хоста

source: Do not paste full URL, just domain
ru: Не вставляйте полный URL, только домен

source: ".." in hostname
ru: ".." в имени

source: Subdomains deeper than 4LD are not allowed
ru: Поддомены глубже 4-го уровня не допускаются

source: Illegal characters in hostname
ru: Недопустимые символы в имени хоста

source: Hostname must not starts with "." or "-"
ru: Имя хоста не должно начинаться с "." или "-"

source: Hostname contain ".-" or "-."
ru: Имя хоста содержит ".-" или "-."

source: Hostname contain "--" and it's not an IDN
ru: Имя хоста содержит "--", но это не IDN-имя

source: Trying to use reserved hostname
ru: Попытка использования зарезервированного имени

source: localhost.* not allowed
ru: localhost.* не допускается

source: You should paste base64 hash, not a base32!
ru: Вы должны вставить base64 хэш, а не base32!

source: Do not paste full hosts.txt entry! Only base64 hash is needed
ru: Не вставляйте полную строку для hosts.txt! Нужен только base64 хэш.

source: Do not paste router hash! Go to i2ptunnel page and find a destination hash
ru: Не указывайте здесь хэш роутера! Пойдите на страницу i2ptunnel и найдите хэш нужного адреса назначения

source: Specified base64 hash is less than 516 bytes
ru: Указанный base64 хэш меньше чем 516 байт

source: Specified base64 hash is bigger than 616 bytes
ru: Указанный base64 хэш больше чем 616 байт

source: Invalid characters in base64 hash
ru: Недопустимые символы в base64 хэше

source: Corrupted base64 hash
ru: Повреждённый base64 хэш

source: Invalid base64 hash
ru: Неправильный base64 хэш

source: Invalid base64 ECDSA or EdDSA hash
ru: Неправильный base64 ECDSA или EdDSA хэш

source: Some host already have the same Base64 hash
ru: Хост с таким base64 хэшем уже зарегистрирован

source: Bad I2P url
ru: Плохой I2P URL

source: I2P hostname
ru: Имя I2P-хоста

source: Base 64 hash
ru: Base 64 хэш

source: Description
ru: Описание

source: Trying to use hostname from additional reserved set
ru: Попытка использования зарезервированного имени из дополнительного списка

source: Filename
ru: Имя файла

source: Search host
ru: Поиск хоста

source: Search
ru: Поиск

source: Home
ru: Главная

source: Browse latest hosts
ru: Недавно добавленные хосты

source: Browse alive hosts
ru: Активные хосты

source: Register a domain
ru: Зарегистрировать домен

source: Contacts
ru: Контакты

source: powered-by
ru: работает на

source: All active hosts in I2P
ru: Все активные хосты в I2P

source: Host
ru: Хост

source: Last seen
ru: Был доступен

source: Date added
ru: Добавлен

source: hosts total
ru: всего хостов

source: How we are learning about new hosts
ru: Как мы узнаём о новых хостах

source: Pulling from external sources:
ru: Опрос внешних источников:

source: Adding through our service.
ru: Добавление через наш сервис.

source: <h3>Expiration</h3> <p> Hosts gets checked for availability every 12 hours. If the host is alive, registration period prolongated 1 month. Until this period ends, hosts are published in our hosts.txt. </p> <p> When a host has expired, its name/key pair will be keept for 2 years but will not be published any longer. Until this period ends, it's impossible to register this hostname again. </p>
ru: <h3>Истечение регистрации</h3> <p> Хосты проверяются на доступность каждые 12 часов. Если хост работает, регистрационный период продлевается на 1 месяц. До тех пор, пока этот период не истёк, хост публикуется в нашем hosts.txt. </p> <p> Когда регистрация хоста истекает, его пара домен/хэш продолжит храниться 2 года, но публиковаться в hosts.txt не будет. Пока этот период не кончился, такой домен нельзя зарегистрировать заново. </p>

source: <h3>Deletion of expired hosts</h3> <p> Hosts expired 2 years ago get completely deleted from our database and become available for a new registration. </p>
ru: <h3>Удаление истёкших регистраций</h3> <p> Хосты, чей срок регистрации истёк 2 года назад, полностью удаляются из базы и становятся снова доступными для регистрации. </p>

source: <h3>Deletion of dead hosts</h3> <p> If a host was added from an external source and we've never seen it alive, it will be deleted after 1 year since its adding date, and after 14 days if it is was added through our registration service. Since these hosts were not published through our service, we only grant them such a short grace period. </p>
ru: <h3>Удаление мёртвых хостов</h3> <p> Если хост был добавлен из внешнего источника и мы никогда не видели его работающим, то он будет удалён через 1 год с момента добавления. Если хост был добавлен через наш сервис, то он будет удалён через 14 дней. Так как такие хосты не публикуются в нашем hosts.txt, мы даём лишь столь небольшой период ожидания. </p>

source: add
ru: добавить

source: You are trying to access an invalid hostname. Maybe you're just mistyped it.
ru: Вы пытаетесь перейти на некорректный узел. Возможно, вы ошиблись при вводе.

source: Error:
ru: Ошибка:

source: You are trying to access an unknown hostname.
ru: Вы пытаетесь перейти к неизвестному нам узлу.

source: <h3>Congratulations! We're found that host you're requesting. Redirecting in 5 secs...</h3> <p> We're suggesting to start use our subscription service. <a href=/>Find more...</a> </p>
ru: <h3>Поздравляем! Мы нашли хост который вы запрашивали. Перенаправление через 5 секунд...</h3> <p> Предлагаем вам воспользоваться нашим сервисом подписки. <a href=/>Узнать больше...</a> </p>

source: <h3>Latest %(hosts_count)s hosts added in %(day_count)s days
ru: <h3>%(hosts_count)s новых хостов, добавленных в течение последних %(day_count)s дней

source: Domain name registration policy
ru: Политика регистрации доменных имён

source: Domain name registration is free.
ru: Регистрация домена бесплатна.

source: Anyone can register a domain name.
ru: Кто угодно может зарегистрировать домен.

source: Domain names are available on a 'first come, first serve' basis.
ru: Домены доступны по принципу "первый пришёл, первый обслуживаешь".

source: A domain name's destination must be active.
ru: Хост, для которого регистрируется имя, должен работать.

source: Inactive destinations cannot be published.
ru: Неработающие хосты не могут быть опубликованы в нашей адресной книге.

source: Domain name hoarding through mass registration (cybersquatting) is not allowed.
ru: Массовая регистрация доменов (киберсквоттинг) запрещена.

source: Domain name registrations will not be rejected based on content.
ru: В регистрации домена не может быть отказано на основании размещённого контента.

source: Domain name registrations will stop propagating after some period of inactivity.
ru: В случае неактивности хоста в течении некоторого периода, публикация домена в адресной книге будет приостановлена.

source: Temporary or test sites should not be registered. Use b32 address instead.
ru: Временные или тестовые сайты не стоит регистрировать. Используйте b32-адрес вместо этого.

source: Changing key for existing domains is prohibited.
ru: Изменение хэша у уже зарегистрированных доменов запрещено.

source: Enter your domain details
ru: Введите сведения о домене

source: Submit
ru: Отправить

source: Search results
ru: Результаты поиска

source: <p> You are trying to add a subdomain. Our policy permits subdomains registration only if you're own an upper domain (2nd-level domain). Before subdomain will be added, we must ensure that you're own an upper-level domain. </p> <p> Unfortunately, we can verify a 2nd-level domain ownage only via http, so if you're use the domain not for http, please run a webserver temporary. Create the following file in the webserver's document root and press "OK" button. This file should be accessible via http://%(topdomain)s/&laquo;filename&raquo; (without quotes). </p>
ru: <p> Вы пытаетесь зарегистрировать поддомен. Наша политика разрешает регистрацию поддоменов если вы владеете доменом вышестоящего уровня (а именно, доменом 2-го уровня). Перед тем, как поддомен будет зарегистрирован, мы должны убедиться что вы владеете доменом вышестоящего уровня. </p> <p> К сожалению, мы можем убедиться в вашем владении доменом 2-го уровня только через http, так что если вы используете этот домен не для http, то пожалуйста запустите на нём веб-сервер временно. Создайте нижеуказанный файл в корневой директории веб-сервера (docroot) и нажмите кнопку "OK". Этот файл должен быть доступен по URL http://%(topdomain)s/&laquo;filename&raquo; (без кавычек). </p>

source: Verification failed. An error occured:
ru: Проверка не удалась. Веб-сервер вернул http-код:

source: Successfully added %(hostname)s. It will be activated after admin's approval and automatic availability test.
ru: Домен %(hostname)s успешно добавлен. Он будет активирован после подтверждения администрации и автоматической проверки на доступность.
